/*
大家都知道斐波那契数列，现在要求输入一个整数n，请你输出斐波那契数列的第n项（从0开始，第0项为0）。
n<=39
*/


// 就是第一个递推公式  注意看给出第一项从多少开始 有的题是0 有的是1
int Fibonacci(int n) {
  // 空间的做法 时间优先
  int fibon[] = {0,1,1,2,3,5,8,13,21,34,55,89,144,233,377,610,987,
			1597,2584,4181,6765,10946,17711,28657,46368,75025,
			121393,196418,317811,514229,832040,1346269,2178309,
			3524578,5702887,9227465,14930352,24157817,39088169,63245986};

  return fibon[n];
}
// 时间的做法 空间优先
    /*
    int Fibonacci(int n) {
        int fibon[40] = {0};
      	int i;

      	fibon[0] = 0;
      	fibon[1] = 1;

      	for(i = 2; i < 40; i++) {
      		fibon[i] = fibon[i - 1] + fibon[i - 2];
      	}

      	return fibon[n];
    }*/
